src/cf/InformationRegisters/ИсторияКОД.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ИсторияКОД</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЕстьОшибки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Размер</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВерсияКонфигурации</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НомерСеанса</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>9</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КраткоеОписание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Уровень</Name>
					<Type>
						<v8:Type>cfg:EnumRef.УровеньИсторииКОД</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Направление</Name>
					<Type>
						<v8:Type>cfg:EnumRef.НаправленияПотоковКОД</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Длительность</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НомерПотока</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ДополнительныеСведения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>УниверсальнаяДатаВМиллисекундах</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Узел</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УзлыКОД</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Сообщение</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ИмяСообщенияКОД</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/НастройкиТранспортаКОД.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>НастройкиТранспортаКОД</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ВидТранспорта</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыТранспортаКОД</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Настройки</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Узел</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УзлыКОД</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/ИсторияКОД/Forms/ФормаЗаписи/Ext/Form/Module.bsl
#Область ОбработчикиСобытийЭлементовФормы

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	ДополнительныеСведения = ТекущийОбъект.ДополнительныеСведения;
	ДополнительныеСведения = СтрЗаменить(ДополнительныеСведения, "\n", Символы.ПС);
	ДополнительныеСведения = СтрЗаменить(ДополнительныеСведения, "\u0009", Символы.Таб);
КонецПроцедуры

&НаКлиенте
Процедура СообщениеОткрытие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	АдресВХранилище = АдресФайлаСообщенияВоВременномХранилище(Запись.Узел, Запись.Сообщение);
	ПолучаемыеФайлы = Новый Массив;
	ПолучаемыеФайлы.Добавить(Новый ОписаниеПередаваемогоФайла(Запись.Сообщение + ".json", АдресВХранилище));
	ОписаниеОповещения = Новый ОписаниеОповещения("СообщениеОткрытиеПослеПолучения", ЭтаФорма);
	НачатьПолучениеФайлов(ОписаниеОповещения, ПолучаемыеФайлы,, Истина);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура СообщениеОткрытиеПослеПолучения(Результат, ПараметрыОповещения) Экспорт
	
	ПроходитАПК = Истина;
	
КонецПроцедуры

&НаСервере
Функция АдресФайлаСообщенияВоВременномХранилище(Узел, Сообщение)
	
	НастройкиТранспорта = РегистрыСведений.НастройкиТранспортаКОД.Получить(Новый Структура("Узел", Узел));
	Настройки = НастройкиТранспорта.Настройки.Получить();
	ПолноеИмяФайлаСообщения = ОбщегоНазначенияКлиентСервер.ДобавитьКонечныйРазделительПути(Настройки.ОбщийКаталог)
		+ Сообщение + ".json";
	Файл = Новый Файл(ПолноеИмяФайлаСообщения); 
	Если Не Файл.Существует() Тогда
		КаталогОбработанных = ОбщегоНазначенияКлиентСервер.ДобавитьКонечныйРазделительПути(Настройки.ОбщийКаталог)
			+ ОбщегоНазначенияКлиентСервер.ДобавитьКонечныйРазделительПути("processed");
		Позиция = СтрНайти(Сообщение, "at");
		Год = Сред(Сообщение, Позиция + 2, 4);
		Месяц = Сред(Сообщение, Позиция + 6, 2);
		День = Сред(Сообщение, Позиция + 8, 2);
		КаталогГода = ОбщегоНазначенияКлиентСервер.ДобавитьКонечныйРазделительПути(КаталогОбработанных + Год);
		КаталогМесяца = ОбщегоНазначенияКлиентСервер.ДобавитьКонечныйРазделительПути(КаталогГода + Месяц);
		КаталогДня = ОбщегоНазначенияКлиентСервер.ДобавитьКонечныйРазделительПути(КаталогМесяца + День);
		ПолноеИмяФайлаСообщения = КаталогДня + Сообщение + ".json";
		Файл = Новый Файл(ПолноеИмяФайлаСообщения); 
		Если Не Файл.Существует() Тогда
			ВызватьИсключение НСтр("ru = 'Сообщение не найдено'");
		КонецЕсли;
	КонецЕсли;
	
	Адрес = ПоместитьВоВременноеХранилище(Новый ДвоичныеДанные(ПолноеИмяФайлаСообщения));
	
	Возврат Адрес;
	
КонецФункции

#КонецОбласти
